## Import Libraries and Data

In [1]:
import pandas as pd
import plotly.express as px
import sqlalchemy

In [2]:
df = pd.read_csv('/Users/lisatosti/Documents/GitHub/coding-temple/week 6/assignments/Taylor_Train.csv', encoding='unicode_escape')
df

,City,Country,Venue,Opening act(s),Attendance (tickets sold / available),Revenue,Tour
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour
...,...,...,...,...,...,...,...
440,Sydney,Australia,ANZ Stadium,Charli XCX\r\nBroods,"72,805 / 72,805","$7,686,564",Reputation_Stadium_Tour
441,Brisbane,Australia,The Gabba,Charli XCX\r\nBroods,"43,907 / 43,907","$4,338,127",Reputation_Stadium_Tour
442,Auckland,New Zealand,Mount Smart Stadium,Charli XCX\r\nBroods,"35,749 / 35,749","$3,617,593",Reputation_Stadium_Tour
443,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109","$14,859,847",Reputation_Stadium_Tour
444,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109","$14,859,847",Reputation_Stadium_Tour

## Tidy Data

* PEP 8 Compliance

In [3]:
df.columns = df.columns.str.replace('(', '')
df.columns = df.columns.str.replace(')', '')
df.columns = df.columns.str.replace('/', '')
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')

df.columns

Index(['city', 'country', 'venue', 'opening_acts',
       'attendance_tickets_sold__available', 'revenue', 'tour'],
      dtype='object')

## Exploratory Data Analysis

In [4]:
df.describe()

,city,country,venue,opening_acts,attendance_tickets_sold__available,revenue,tour
count,445,445,445,444,442,442,445
unique,143,24,206,41,295,296,5
top,Los Angeles,United States,Staples Center,Gloriana\r\nKellie Pickler,,,Fearless_Tour
freq,16,314,16,85,35,36,111

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 7 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   city                                445 non-null    object
 1   country                             445 non-null    object
 2   venue                               445 non-null    object
 3   opening_acts                        444 non-null    object
 4   attendance_tickets_sold__available  442 non-null    object
 5   revenue                             442 non-null    object
 6   tour                                445 non-null    object
dtypes: object(7)
memory usage: 24.5+ KB

In [6]:
df.shape

(445, 7)

In [7]:
df['attendance_tickets_sold__available'].value_counts()

attendance_tickets_sold__available
                  35
70,563 / 70,563     5
54,900 / 54,900     4
55,829 / 55,829     4
51,487 / 51,487     4
                   ..
17,003 / 17,003     1
48,265 / 48,265     1
15,135 / 15,135     1
14,267 / 14,267     1
7,463 / 7,463       1
Name: count, Length: 295, dtype: int64

In [8]:
df['attendance_tickets_sold'] = df['attendance_tickets_sold__available'].str.split(' / ').str[0]
df.head()

,city,country,venue,opening_acts,attendance_tickets_sold__available,revenue,tour,attendance_tickets_sold
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour,"7,463"
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour,"7,822"
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour,"13,764"
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour,
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour,"8,751"

In [9]:
df['attendance_tickets_available'] = df['attendance_tickets_sold__available'].str.split(' / ').str[1]
df.head()

,city,country,venue,opening_acts,attendance_tickets_sold__available,revenue,tour,attendance_tickets_sold,attendance_tickets_available
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour,"7,463","7,463"
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour,"7,822","7,822"
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour,"13,764","13,764"
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour,,NaN
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour,"8,751","8,751"

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 9 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   city                                445 non-null    object
 1   country                             445 non-null    object
 2   venue                               445 non-null    object
 3   opening_acts                        444 non-null    object
 4   attendance_tickets_sold__available  442 non-null    object
 5   revenue                             442 non-null    object
 6   tour                                445 non-null    object
 7   attendance_tickets_sold             442 non-null    object
 8   attendance_tickets_available        407 non-null    object
dtypes: object(9)
memory usage: 31.4+ KB

In [ ]:
df['revenue'].value_counts()

Since only 8% of the data will be affected by filling the null values of revenue and attendance tickets sold/available, we will proceed with filling the values with the mean.

After filling the values, we will be able to convert the data types.

In [ ]:
df.isna().sum()

In [ ]:
#Because the data type is currently an object, we cannot change null values to mean. So we will make them match other 
#unavailable data
df['revenue'] = df['revenue'].fillna('-')

df['attendance_tickets_sold__available'] = df['attendance_tickets_sold__available'].fillna('-')

In [ ]:
#This regex expression will remove non-numeric values. ^ matches from the beginning to the end and \d will grab any character
#that is not a digit from 0 to 9. Therefore ^\d will start at the beginning and go to the end and replace any non digit with ''
df['revenue'] = df['revenue'].str.replace('[^\d]', '', regex=True)
#This will replace any empty string values created by the regex above and fill them with zeros in string format to match 
#current data type
df['revenue'] = df['revenue'].replace('', '0')
#Change data type to integer
df['revenue'] = df['revenue'].astype(int)

In [ ]:
df['attendance_tickets_sold__available'].value_counts()

In [ ]:
#Repeat for attendance_tickets_sold__available
#This regex expression will remove non-numeric values
df['attendance_tickets_sold__available'] = df['attendance_tickets_sold__available'].str.replace('[^\d]', '', regex=True)
#This will replace any empty string values created by the regex above and fill them with zeros in string format to match 
#current data type
df['attendance_tickets_sold__available'] = df['attendance_tickets_sold__available'].replace('', '0')
#Change data type to integer
df['attendance_tickets_sold__available'] = df['attendance_tickets_sold__available'].astype(int)

In [ ]:
df['revenue'].value_counts()

In [ ]:
df['attendance_tickets_sold__available'].value_counts()

### Fill NA Values

In [ ]:
df.isna().sum()

In [ ]:
df['opening_acts'] = df['opening_acts'].fillna('Unknown')

In [ ]:
df.isna().sum()

## Visualizations:

In [ ]:
for col in df.columns:
    if df[col].dtype != 'O':
        display(px.histogram(df,col))

## Connect to MySQL and Export a CSV

MySQL connection is still not working. For the time being, I will just create a CSV

In [ ]:
df.to_csv('taylor_swift_tour_data.csv', index=False)